{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Python & neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. Python packages for Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import random"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### native Python driver\n",
    "\n",
    "`pip install neo4j`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase\n",
    "\n",
    "uri = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = 'test'\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(user, password))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# delete all data\n",
    "with driver.session() as session:\n",
    "    q = \"MATCH (n) DETACH DELETE n\"\n",
    "    session.run(q)\n",
    "    \n",
    "# add some nodes\n",
    "with driver.session() as session:\n",
    "    \n",
    "    for i in range(100):\n",
    "        q = \"CREATE (n:Person) SET n.name = $value, n.city = $city\"\n",
    "        session.run(q, value=i, city='Freiburg')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create some relationships\n",
    "with driver.session() as session:\n",
    "    for i in range(300):\n",
    "        \n",
    "        left_name = random.choice(range(100))\n",
    "        right_name = random.choice(range(100))\n",
    "\n",
    "        q = \"MATCH (n1:Person), (n2:Person) \" \\\n",
    "            \"WHERE n1.name = $left and n2.name = $right \" \\\n",
    "            \"CREATE (n1)-[:FRIEND]->(n2)\"\n",
    "\n",
    "        session.run(q, left=left_name, right=right_name)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# cheat a bit and make sure Person '1' has relationships for examples below\n",
    "\n",
    "with driver.session() as session:\n",
    "    for i in range(3):\n",
    "        \n",
    "        left_name = 1\n",
    "        right_name = random.choice(range(100))\n",
    "\n",
    "        q = \"MATCH (n1:Person), (n2:Person) \" \\\n",
    "            \"WHERE n1.name = $left and n2.name = $right \" \\\n",
    "            \"CREATE (n1)-[:FRIEND]->(n2)\"\n",
    "\n",
    "        session.run(q, left=left_name, right=right_name)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# get some data\n",
    "with driver.session() as session:\n",
    "    \n",
    "    q = \"MATCH (p:Person)-[:FRIEND]-(x) \" \\\n",
    "        \"RETURN p.name, count(x)\"\n",
    "    \n",
    "    result = session.run(q)    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['attached', 'consume', 'data', 'detach', 'graph', 'keys', 'parameters', 'peek', 'records', 'session', 'single', 'statement', 'summary', 'value', 'values', 'zipper']\n",
      "\n",
      "<Record p.name=97 count(x)=11>\n",
      "\n",
      "('p.name', 'count(x)')\n",
      "\n",
      "<neo4j.v1.result.BoltStatementResultSummary object at 0x10a99aa20>\n",
      "MATCH (p:Person)-[:FRIEND]-(x) RETURN p.name, count(x)\n"
     ]
    }
   ],
   "source": [
    "print([x for x in dir(result) if '_' not in x])\n",
    "\n",
    "# look into the result object\n",
    "print()\n",
    "print(\n",
    "    result.peek()\n",
    ")\n",
    "print()\n",
    "print(\n",
    "    result.keys()\n",
    ")\n",
    "print()\n",
    "\n",
    "# the result object contains a Summary object\n",
    "print(\n",
    "    result.summary()\n",
    ")\n",
    "print(\n",
    "    result.summary().statement\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The result resides in the result buffer until it is consumed\n",
    "\n",
    "It behaves like a generator, you can iterate once or store it in a list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "result_consumed = list(result) # store the result in a list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record p.name=97 count(x)=11>\n"
     ]
    }
   ],
   "source": [
    "# the result is a list of Records\n",
    "# a Record is an ordered ordered map of keys and values\n",
    "\n",
    "record = result_consumed[0]\n",
    "\n",
    "print(record)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# you can access the data of Record by key or index\n",
    "\n",
    "print(record[0], record[1])\n",
    "\n",
    "print(record['p.name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# get some data\n",
    "with driver.session() as session:\n",
    "    \n",
    "    q = \"MATCH (p:Person)-[:FRIEND]-(x) \" \\\n",
    "        \"RETURN p.name AS name, count(x) AS count\"\n",
    "    \n",
    "    result = session.run(q)    \n",
    "    \n",
    "# the result resides in the result buffer until it is consumed\n",
    "# it behaves like a generator, you can iterate once or store it in a list\n",
    "result_consumed = list(result) # store the result in a list\n",
    "\n",
    "record = result_consumed[0]\n",
    "\n",
    "print(record['name'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from py2neo.ogm import GraphObject, Property"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = 'test'\n",
    "\n",
    "graph = Graph(uri, auth=(user, password))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Py2neo exposes several logical layers of API on top of the official Python driver. The lowest level Cypher API provides Cypher execution facilities very similar to those in the driver, but with a few extras such as coercion to a Table object:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.run(\"MATCH (a:Person) RETURN a.name, a.city LIMIT 2\").to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The next level up, the Entity API, wraps Cypher in convenience functions that provide a full set of CRUD operations on Node and Relationship objects.\n",
    "\n",
    "This can make for clearer application code at the expense of fine-grained control. The NodeMatcher, for example, constructs and executes a Cypher MATCH statement and returns Node objects:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = graph.nodes.match(\"Person\").limit(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for r in result:\n",
    "    print(r['name'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The topmost level of API is Py2neo’s OGM API. This allows creation of GraphObjects that wrap nodes in native classes and provide attributes to model their relationships and properties."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Person(GraphObject):\n",
    "    name = Property()\n",
    "    city = Property()\n",
    "    \n",
    "result = Person.match(graph).limit(3)\n",
    "\n",
    "for r in result:\n",
    "    print(r.name, r.city)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Matching nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.nodes.match(\"Person\", name=3).first()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "result = graph.nodes.match(\"Person\").where(\"_.name > 5 AND _.name < 8\")\n",
    "\n",
    "for r in result:\n",
    "    print(r)\n",
    "    print(type(r))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Matching relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "number1 = graph.nodes.match(\"Person\", name=1).first()\n",
    "\n",
    "rels = graph.relationships.match((number1, None), \"FRIEND\").limit(3)\n",
    "\n",
    "list(rels)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get data into pandas\n",
    "\n",
    "```\n",
    ".to_data_frame()\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df = graph.run(\"MATCH (a:Person) RETURN a.name, a.city\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### neomodel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. graph libraries for Python"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### NetworkX\n",
    "\n",
    "Tutorial: http://www.solasistim.net/posts/neo4j_to_networkx/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import config\n",
    "\n",
    "uri = 'bolt://localhost:7687'\n",
    "user = 'neo4j'\n",
    "password = 'test'\n",
    "\n",
    "config.DATABASE_URL = 'bolt://neo4j:test@localhost:7687'  # default"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel import (config, StructuredNode, StringProperty, IntegerProperty,\n",
    "    UniqueIdProperty, RelationshipTo, Relationship)\n",
    "\n",
    "class Person(StructuredNode):\n",
    "    name = IntegerProperty(unique_index=True)\n",
    "    city = StringProperty(index=True, default='Freiburg')\n",
    "\n",
    "    # traverse outgoing IS_FROM relations, inflate to Country objects\n",
    "    friends = RelationshipTo('Person', 'FRIEND')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Add nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "last_one = Person(name=999, city='Freiburg').save() # Create"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "last_one.id"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "all_nodes = Person.nodes.all()\n",
    "print(all_nodes[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Get relationships"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "first_one = Person.nodes.get_or_none(name=1)\n",
    "\n",
    "first_one.friends.all()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
